backend/controllers/SemestreController.php

    protected function findModel($id)
    {
        if (($model = Semestre::findOne($id)) !== null) {
---
SELECT * FROM `semestre` WHERE `id`='7'